#################################################################################################
#Задача 1

members = [[1, 2 ,3], [4, 5, 6], [7, 8, 9]]

for i_team in members:
    for i_man in i_team:
        print(i_man, end=' ')
    print()

#################################################################################################
#Задача 2

amount = int(input('Количество участников: '))
K = int(input('Количество человек в команде: '))
pip_list = []
number = 1

for i in range(amount // K):
    pip_list.append(list(range(number, number + K)))
    number += K

print(pip_list)

#################################################################################################
#Задача 3

goods = [["яблоки", 50], ["апельсины", 190], ["груши", 100], ["нектарины", 200], ["бананы", 77]]

fruit = input('Новый фрукт: ')
prise = int(input('Цена: '))
goods.append([fruit,prise])

print('Новый ассортимент:', goods)

for i in goods:
    i[1] = round(i[1] * 1.08, 2)

print('Новый ассортимент с увел. ценой:', goods)