#################################################################################################
#Задача 1

name = input('Имя:')
order = input('Номер заказа:')

print(f'Здравствуйте, {name} Ваш номер заказа: {order}. Приятного дня!')

#################################################################################################
#Задача 2

name = input('Имя:')
money = input('Введите долг:')

print('{0}! {0}, привет! Как дела, {0}? Где мои {1} рублей? {j}! '.format(name, money))

#################################################################################################
#Задача 3

ip_add = []
counter = 1
while True:
    numbers = int(input('Введите число от 0 до 255:'))
    if numbers < 0 or numbers > 256:
        print('Ошибка!')
    elif counter == 5:
        break
    else:
        ip_add.append(numbers)
        counter += 1
print(ip_add)

print('Пример правильного адреса: {0}.{1}.{2}.{3}'.format(ip_add[0], ip_add[1], ip_add[2], ip_add[3]))